infrastructure/experiments/roundrobin-3/ab_10_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2676 bytes

Concurrency Level:      1
Time taken for tests:   0.204 seconds
Complete requests:      10
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Total transferred:      28786 bytes
HTML transferred:       26966 bytes
Requests per second:    49.04 [#/sec] (mean)
Time per request:       20.392 [ms] (mean)
Time per request:       20.392 [ms] (mean, across all concurrent requests)
Transfer rate:          137.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.1      1       1
Processing:    13   19   7.8     15      33
Waiting:       13   19   7.8     15      33
Total:         14   20   7.7     16      34

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     18
  75%     30
  80%     30
  90%     34
  95%     34
  98%     34
  99%     34
 100%     34 (longest request)
